spec/fixtures/transactions/google_payment.json

{
  "receiptId": "xxxxxxx",
  "yourPaymentReference": "xxxxxxxxxxxxxxxxxxxxxx",
  "type": "Payment",
  "createdAt": "2016-11-03T15:02:26.8290+00:00",
  "result": "Success",
  "message": "AuthCode: xxxxxx",
  "judoId": "xxxxxxxxx",
  "merchantName": "xxxxxxxxxxxx",
  "appearsOnStatementAs": "xxxxxxxxxxxxx",
  "originalAmount": "0.02",
  "netAmount": "0.02",
  "amount": "0.02",
  "currency": "GBP",
  "cardDetails": {
    "cardLastfour": "xxxx",
    "endDate": "xxxx",
    "cardToken": "xxxx",
    "cardType": 1
  },
  "consumer": {
    "consumerToken": "xxxxxxxxxxxxxx",
    "yourConsumerReference": "xxxxxxxxxxxxxxxx"
  },
  "walletType": 2
}
